raw/sysbench-iobound_heavy-10000-pareto-psfm32-rocks-60000000-512-ranges_ro.txt
sysbench 0.9:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 512
Report intermediate results every 10 second(s)
Initializing random number generator from current time


setting write concern to 1
Threads started!

[  10s] threads: 512, tps: 52208.86, reads: 156628.58, writes: 0.00, response time: 41.16ms (95%), errors: 0.00, reconnects:  0.00
[  20s] threads: 512, tps: 53715.85, reads: 161147.44, writes: 0.00, response time: 40.61ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 512, tps: 53560.79, reads: 160682.36, writes: 0.00, response time: 40.87ms (95%), errors: 0.00, reconnects:  0.00
[  40s] threads: 512, tps: 53534.51, reads: 160604.63, writes: 0.00, response time: 40.80ms (95%), errors: 0.00, reconnects:  0.00
[  50s] threads: 512, tps: 53418.89, reads: 160255.58, writes: 0.00, response time: 40.96ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 512, tps: 53508.11, reads: 160524.53, writes: 0.00, response time: 40.87ms (95%), errors: 0.00, reconnects:  0.00
[  70s] threads: 512, tps: 56007.50, reads: 168117.99, writes: 0.00, response time: 39.99ms (95%), errors: 0.00, reconnects:  0.00
[  80s] threads: 512, tps: 56275.39, reads: 168825.87, writes: 0.00, response time: 39.82ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 512, tps: 56157.31, reads: 168471.92, writes: 0.00, response time: 39.86ms (95%), errors: 0.00, reconnects:  0.00
[ 100s] threads: 512, tps: 56147.39, reads: 168442.88, writes: 0.00, response time: 39.84ms (95%), errors: 0.00, reconnects:  0.00
[ 110s] threads: 512, tps: 56285.41, reads: 168856.44, writes: 0.00, response time: 39.97ms (95%), errors: 0.00, reconnects:  0.00
[ 120s] threads: 512, tps: 56124.57, reads: 168373.70, writes: 0.00, response time: 40.09ms (95%), errors: 0.00, reconnects:  0.00
[ 130s] threads: 512, tps: 51406.23, reads: 154170.78, writes: 0.00, response time: 42.56ms (95%), errors: 0.00, reconnects:  0.00
[ 140s] threads: 512, tps: 50993.84, reads: 152981.51, writes: 0.00, response time: 42.25ms (95%), errors: 0.00, reconnects:  0.00
[ 150s] threads: 512, tps: 50908.16, reads: 152725.28, writes: 0.00, response time: 42.48ms (95%), errors: 0.00, reconnects:  0.00
[ 160s] threads: 512, tps: 50857.38, reads: 152570.93, writes: 0.00, response time: 42.56ms (95%), errors: 0.00, reconnects:  0.00
[ 170s] threads: 512, tps: 50876.94, reads: 152630.83, writes: 0.00, response time: 42.55ms (95%), errors: 0.00, reconnects:  0.00
[ 180s] threads: 512, tps: 50889.59, reads: 152669.46, writes: 0.00, response time: 42.46ms (95%), errors: 0.00, reconnects:  0.00
[ 190s] threads: 512, tps: 53987.30, reads: 161913.79, writes: 0.00, response time: 41.01ms (95%), errors: 0.00, reconnects:  0.00
[ 200s] threads: 512, tps: 54262.09, reads: 162786.37, writes: 0.00, response time: 40.74ms (95%), errors: 0.00, reconnects:  0.00
[ 210s] threads: 512, tps: 54228.11, reads: 162683.34, writes: 0.00, response time: 40.97ms (95%), errors: 0.00, reconnects:  0.00
[ 220s] threads: 512, tps: 54213.80, reads: 162641.81, writes: 0.00, response time: 40.97ms (95%), errors: 0.00, reconnects:  0.00
[ 230s] threads: 512, tps: 54167.60, reads: 162503.41, writes: 0.00, response time: 41.00ms (95%), errors: 0.00, reconnects:  0.00
[ 240s] threads: 512, tps: 54170.46, reads: 162511.58, writes: 0.00, response time: 40.74ms (95%), errors: 0.00, reconnects:  0.00
[ 250s] threads: 512, tps: 53697.32, reads: 161090.65, writes: 0.00, response time: 40.70ms (95%), errors: 0.00, reconnects:  0.00
[ 260s] threads: 512, tps: 53507.21, reads: 160523.04, writes: 0.00, response time: 40.81ms (95%), errors: 0.00, reconnects:  0.00
[ 270s] threads: 512, tps: 53520.41, reads: 160561.12, writes: 0.00, response time: 40.73ms (95%), errors: 0.00, reconnects:  0.00
[ 280s] threads: 512, tps: 53652.51, reads: 160956.82, writes: 0.00, response time: 40.63ms (95%), errors: 0.00, reconnects:  0.00
[ 290s] threads: 512, tps: 53549.59, reads: 160648.28, writes: 0.00, response time: 40.73ms (95%), errors: 0.00, reconnects:  0.00
[ 300s] threads: 512, tps: 53464.17, reads: 160394.22, writes: 0.00, response time: 40.79ms (95%), errors: 0.00, reconnects:  0.00
[ 310s] threads: 512, tps: 55912.00, reads: 167830.90, writes: 0.00, response time: 39.97ms (95%), errors: 0.00, reconnects:  0.00
[ 320s] threads: 512, tps: 56162.87, reads: 168486.82, writes: 0.00, response time: 40.15ms (95%), errors: 0.00, reconnects:  0.00
[ 330s] threads: 512, tps: 56108.73, reads: 168328.30, writes: 0.00, response time: 39.97ms (95%), errors: 0.00, reconnects:  0.00
[ 340s] threads: 512, tps: 56174.61, reads: 168523.53, writes: 0.00, response time: 39.89ms (95%), errors: 0.00, reconnects:  0.00
[ 350s] threads: 512, tps: 56192.39, reads: 168576.96, writes: 0.00, response time: 40.04ms (95%), errors: 0.00, reconnects:  0.00
[ 360s] threads: 512, tps: 56157.82, reads: 168473.05, writes: 0.00, response time: 40.10ms (95%), errors: 0.00, reconnects:  0.00
[ 370s] threads: 512, tps: 51566.91, reads: 154654.04, writes: 0.00, response time: 42.41ms (95%), errors: 0.00, reconnects:  0.00
[ 380s] threads: 512, tps: 50987.00, reads: 152961.10, writes: 0.00, response time: 42.31ms (95%), errors: 0.00, reconnects:  0.00
[ 390s] threads: 512, tps: 50860.75, reads: 152581.84, writes: 0.00, response time: 42.38ms (95%), errors: 0.00, reconnects:  0.00
[ 400s] threads: 512, tps: 50784.42, reads: 152352.77, writes: 0.00, response time: 42.67ms (95%), errors: 0.00, reconnects:  0.00
[ 410s] threads: 512, tps: 50765.22, reads: 152295.77, writes: 0.00, response time: 42.64ms (95%), errors: 0.00, reconnects:  0.00
[ 420s] threads: 512, tps: 50965.30, reads: 152895.99, writes: 0.00, response time: 42.53ms (95%), errors: 0.00, reconnects:  0.00
[ 430s] threads: 512, tps: 53747.39, reads: 161194.38, writes: 0.00, response time: 41.37ms (95%), errors: 0.00, reconnects:  0.00
[ 440s] threads: 512, tps: 54270.60, reads: 162811.61, writes: 0.00, response time: 40.59ms (95%), errors: 0.00, reconnects:  0.00
[ 450s] threads: 512, tps: 54254.12, reads: 162762.05, writes: 0.00, response time: 40.65ms (95%), errors: 0.00, reconnects:  0.00
[ 460s] threads: 512, tps: 54207.19, reads: 162622.07, writes: 0.00, response time: 40.96ms (95%), errors: 0.00, reconnects:  0.00
[ 470s] threads: 512, tps: 54202.80, reads: 162608.21, writes: 0.00, response time: 40.76ms (95%), errors: 0.00, reconnects:  0.00
[ 480s] threads: 512, tps: 54081.89, reads: 162245.47, writes: 0.00, response time: 41.17ms (95%), errors: 0.00, reconnects:  0.00
[ 490s] threads: 512, tps: 53726.31, reads: 161178.32, writes: 0.00, response time: 40.53ms (95%), errors: 0.00, reconnects:  0.00
[ 500s] threads: 512, tps: 53625.69, reads: 160877.77, writes: 0.00, response time: 40.74ms (95%), errors: 0.00, reconnects:  0.00
[ 510s] threads: 512, tps: 53444.93, reads: 160334.58, writes: 0.00, response time: 40.79ms (95%), errors: 0.00, reconnects:  0.00
[ 520s] threads: 512, tps: 53541.58, reads: 160625.25, writes: 0.00, response time: 40.92ms (95%), errors: 0.00, reconnects:  0.00
[ 530s] threads: 512, tps: 53436.62, reads: 160309.56, writes: 0.00, response time: 40.80ms (95%), errors: 0.00, reconnects:  0.00
[ 540s] threads: 512, tps: 53584.69, reads: 160754.86, writes: 0.00, response time: 40.68ms (95%), errors: 0.00, reconnects:  0.00
[ 550s] threads: 512, tps: 55935.18, reads: 167899.13, writes: 0.00, response time: 40.06ms (95%), errors: 0.00, reconnects:  0.00
[ 560s] threads: 512, tps: 56309.02, reads: 168928.77, writes: 0.00, response time: 39.91ms (95%), errors: 0.00, reconnects:  0.00
[ 570s] threads: 512, tps: 56282.09, reads: 168845.46, writes: 0.00, response time: 40.00ms (95%), errors: 0.00, reconnects:  0.00
[ 580s] threads: 512, tps: 56319.20, reads: 168957.70, writes: 0.00, response time: 39.86ms (95%), errors: 0.00, reconnects:  0.00
[ 590s] threads: 512, tps: 56334.81, reads: 169004.93, writes: 0.00, response time: 39.88ms (95%), errors: 0.00, reconnects:  0.00
[ 600s] threads: 502, tps: 56189.41, reads: 168568.12, writes: 0.00, response time: 39.87ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            97064391
        write:                           0
        other:                           32354797
        total:                           129419188
    transactions:                        32354797 (53922.66 per sec.)
    read/write requests:                 97064391 (161767.98 per sec.)
    other operations:                    32354797 (53922.66 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0223s
    total number of events:              32354797
    total time taken by event execution: 307153.2591s
    response time:
         min:                                  0.31ms
         avg:                                  9.49ms
         max:                               3068.03ms
         approx.  95 percentile:              41.55ms

Threads fairness:
    events (avg/stddev):           63192.9629/400.41
    execution time (avg/stddev):   599.9087/0.01