raw/sysbench-wt-uniform-128-oltp_ro.txt
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 128
Report intermediate results every 10 second(s)
Initializing random number generator from current time


setting write concern to 1
Initializing worker threads...

Threads started!

[  10s] threads: 128, tps: 12183.52, reads: 103530.69, writes: 0.00, response time: 21.48ms (95%), errors: 0.00, reconnects:  0.00
[  20s] threads: 128, tps: 13136.06, reads: 111588.45, writes: 0.00, response time: 19.44ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 128, tps: 13174.00, reads: 111964.21, writes: 0.00, response time: 19.33ms (95%), errors: 0.00, reconnects:  0.00
[  40s] threads: 128, tps: 13205.03, reads: 112297.89, writes: 0.00, response time: 19.30ms (95%), errors: 0.00, reconnects:  0.00
[  50s] threads: 128, tps: 13193.90, reads: 112128.93, writes: 0.00, response time: 19.34ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 128, tps: 13189.00, reads: 112177.19, writes: 0.00, response time: 19.39ms (95%), errors: 0.00, reconnects:  0.00
[  70s] threads: 128, tps: 13155.40, reads: 111717.24, writes: 0.00, response time: 19.35ms (95%), errors: 0.00, reconnects:  0.00
[  80s] threads: 128, tps: 13172.99, reads: 112037.05, writes: 0.00, response time: 19.36ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 128, tps: 13140.11, reads: 111782.95, writes: 0.00, response time: 19.47ms (95%), errors: 0.00, reconnects:  0.00
[ 100s] threads: 128, tps: 13172.59, reads: 111899.75, writes: 0.00, response time: 19.37ms (95%), errors: 0.00, reconnects:  0.00
[ 110s] threads: 128, tps: 13204.81, reads: 112327.96, writes: 0.00, response time: 19.35ms (95%), errors: 0.00, reconnects:  0.00
[ 120s] threads: 128, tps: 13163.56, reads: 111819.14, writes: 0.00, response time: 19.33ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            13353417
        write:                           0
        other:                           1571039
        total:                           14924456
    transactions:                        1571039 (13091.00 per sec.)
    read/write requests:                 13353417 (111270.08 per sec.)
    other operations:                    1571039 (13091.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0091s
    total number of events:              1571039
    total time taken by event execution: 15358.3788s
    response time:
         min:                                  0.87ms
         avg:                                  9.78ms
         max:                                 71.77ms
         approx.  95 percentile:              19.51ms

Threads fairness:
    events (avg/stddev):           12273.7422/55.80
    execution time (avg/stddev):   119.9873/0.00